src/cf/InformationRegisters/ПараметрыОбменСБанками.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ПараметрыОбменСБанками</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПоследняяДатаПолученияЭД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерЗапроса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьЖурналирование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КаталогДляЖурналирования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСинхронизации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвтоматическоеПолучениеВыписки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПолученияВыписки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПоследнейОперации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторКлиента</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоСообщенийВПакете</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НастройкаОбмена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиОбменСБанками</v8:Type>
						<v8:Type>cfg:CatalogRef.УдалитьСоглашенияОбИспользованииЭД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ПрограммыБанка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ПрограммыБанка</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АльфаБанкОнлайн</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АсинхронныйОбмен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбменЧерезВК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбменЧерезДопОбработку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СбербанкОнлайн</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FintechIntegration</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/InformationRegisters/ПараметрыОбменСБанками/Forms/РедактированиеЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.НастройкаОбмена) Тогда
		ТекущаяЗапись = РегистрыСведений.ПараметрыОбменСБанками.СоздатьМенеджерЗаписи();
		ТекущаяЗапись.НастройкаОбмена = Параметры.НастройкаОбмена;
		ТекущаяЗапись.Прочитать();
		
		// Для новой настройки записей в регистре еще нет
		Если Не ТекущаяЗапись.Выбран() Тогда
			ТекущаяЗапись.НастройкаОбмена = Параметры.НастройкаОбмена;
			КоличествоСообщенийВПакете = 1;
		КонецЕсли;
	
		ЗначениеВРеквизитФормы(ТекущаяЗапись, "Запись");
		
		РеквизитыНастройкиОбмена = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
			Параметры.НастройкаОбмена, 
			"ПрограммаБанка, ИспользуетсяКриптография");
		ПрограммаБанка = РеквизитыНастройкиОбмена.ПрограммаБанка;
		ИспользуетсяКриптография = РеквизитыНастройкиОбмена.ИспользуетсяКриптография;
		
	КонецЕсли;
	
	Элементы.КаталогДляЖурналирования.Видимость = Запись.ИспользоватьЖурналирование
		И (ПрограммаБанка = Перечисления.ПрограммыБанка.ОбменЧерезВК
			ИЛИ ПрограммаБанка = Перечисления.ПрограммыБанка.СбербанкОнлайн И ИспользуетсяКриптография);

	Элементы.ОткрытьЖурнал.Видимость = НЕ Элементы.КаталогДляЖурналирования.Видимость
										И Запись.ИспользоватьЖурналирование;
										
	Элементы.ДатаПолученияЭД.Видимость = 
		ПрограммаБанка = Перечисления.ПрограммыБанка.АсинхронныйОбмен;
	Элементы.ИспользоватьАвтоматическоеОпределениеWindows7.Видимость = 
		ПрограммаБанка = Перечисления.ПрограммыБанка.СбербанкОнлайн;
		
	Элементы.ГруппаПакетныйОбмен.Видимость = ПрограммаБанка = Перечисления.ПрограммыБанка.АсинхронныйОбмен;
	КоличествоСообщенийВПакете = Запись.КоличествоСообщенийВПакете;
	ИспользоватьПакетныйОбмен = КоличествоСообщенийВПакете > 1;
	ПоказатьПредупреждениеОКоличествеСообщений = КоличествоСообщенийВПакете <= 50;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	#Если ВебКлиент Тогда
		Элементы.КаталогДляЖурналирования.КнопкаВыбора = Ложь;
		Оповещение = Новый ОписаниеОповещения("ПослеПодключенияРасширенияДляРаботыСФайламиПриОткрытии", ЭтотОбъект);
		НачатьПодключениеРасширенияРаботыСФайлами(Оповещение);
	#КонецЕсли
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	ИдентификаторКлиента = СистемнаяИнформация.ИдентификаторКлиента;
	
	ИспользоватьАвтоматическоеОпределениеWindows7 = ОбменСБанкамиСлужебныйВызовСервера.ПолучитьНастройкуПользователяДиректБанк(
		ИдентификаторКлиента,
		"VPNKeyTLS", 
		"ИспользоватьАвтоматическоеОпределениеWindows7"); 
		
	ИспользоватьПакетныйОбменОбработкаИзменения();

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Запись.ИспользоватьЖурналирование И Не ЗначениеЗаполнено(Запись.КаталогДляЖурналирования)
		И (ПрограммаБанка = ПредопределенноеЗначение("Перечисление.ПрограммыБанка.ОбменЧерезВК")
			ИЛИ ПрограммаБанка = ПредопределенноеЗначение("Перечисление.ПрограммыБанка.СбербанкОнлайн")
				И ИспользуетсяКриптография) Тогда
		ТекстСообщения = НСтр("ru = 'Укажите каталог для журналирования.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , "Запись.КаталогДляЖурналирования", , Отказ);
		Возврат;
	КонецЕсли;
	
	Запись.ИдентификаторКлиента = ИдентификаторКлиента; 
	
	Запись.КоличествоСообщенийВПакете = ?(КоличествоСообщенийВПакете = 0,1,КоличествоСообщенийВПакете);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОбменСБанкамиСлужебныйКлиент.СохранитьНастройкуПользователяДиректБанк(
		"VPNKeyTLS",
		"ИспользоватьАвтоматическоеОпределениеWindows7", ИспользоватьАвтоматическоеОпределениеWindows7);
	Если НЕ ИспользоватьАвтоматическоеОпределениеWindows7 Тогда
		ОбменСБанкамиСлужебныйКлиент.СохранитьНастройкуПользователяДиректБанк(
			"VPNKeyTLS",
			"ОчиститьВерсииWindowsКлиентскихПриложений",
			Неопределено);
		// Очистим кеш с версией компоненты 1.2.9.6 для Windows7
		ОбменСБанкамиСлужебныйКлиент.ЗакешироватьПараметрСбербанка("VPNKeyTLS_1_2_9_6", Неопределено);
	КонецЕсли;
	
	Оповестить("ИзмененаНастройкаОбменСБанками", Запись.НастройкаОбмена);
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИспользоватьЖурналированиеПриИзменении(Элемент)

	Элементы.КаталогДляЖурналирования.Видимость = Запись.ИспользоватьЖурналирование
		И (ПрограммаБанка = ПредопределенноеЗначение("Перечисление.ПрограммыБанка.ОбменЧерезВК")
			ИЛИ ПрограммаБанка = ПредопределенноеЗначение("Перечисление.ПрограммыБанка.СбербанкОнлайн")
				И ИспользуетсяКриптография);

	Элементы.ОткрытьЖурнал.Видимость = НЕ Элементы.КаталогДляЖурналирования.Видимость И Запись.ИспользоватьЖурналирование;

КонецПроцедуры

&НаКлиенте
Процедура КаталогДляЖурналированияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораКаталога", ЭтотОбъект);
	ФайловаяСистемаКлиент.ВыбратьКаталог(Оповещение, НСтр("ru = 'Выберите каталог для сохранения файлов журнала.'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЖурналНажатие(Элемент)
	
	ПараметрыФормы = Новый Структура("НастройкаОбмена", Запись.НастройкаОбмена);
	ОткрытьФорму("Обработка.ОбменСБанками.Форма.ЖурналОбмена", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьПакетныйОбменПриИзменении(Элемент)
	
	Если ИспользоватьПакетныйОбмен Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ПриПолученииОтветаНаВопросИспользоватьПакетныйОбмен",ЭтотОбъект);
		
		МассивТекста = Новый Массив;
		МассивТекста.Добавить(НСтр("ru = 'Перед изменением параметра необходимо проконсультироваться со службой технической поддержки банка.'"));
		МассивТекста.Добавить("");
		МассивТекста.Добавить(НСтр("ru = 'Продолжить?'"));
		ТекстВопроса = СтрСоединить(МассивТекста,Символы.ПС);
		
		КнопкиОтвета = Новый СписокЗначений;
		КнопкиОтвета.Добавить(КодВозвратаДиалога.Да,НСтр("ru = 'Продолжить'"));
		КнопкиОтвета.Добавить(КодВозвратаДиалога.Отмена, НСтр("ru = 'Отмена'"));
		
		ПоказатьВопрос(ОписаниеОповещения,ТекстВопроса,КнопкиОтвета,,,НСтр("ru = 'Внимание!'"));
	Иначе
		КоличествоСообщенийВПакете = 1;
		ИспользоватьПакетныйОбменОбработкаИзменения();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КоличествоСообщенийВПакетеРегулирование(Элемент, Направление, СтандартнаяОбработка)
	                         
	КоличествоСообщенийВПакетеПриИзменении(Элемент);
		
КонецПроцедуры

&НаКлиенте
Процедура КоличествоСообщенийВПакетеПриИзменении(Элемент)
	
	Если КоличествоСообщенийВПакете > 50 И ПоказатьПредупреждениеОКоличествеСообщений Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПриПолученииОтветаНаВопросКоличествоСообщенийВПакете", ЭтотОбъект);
		
		МассивТекста = Новый Массив;
		МассивТекста.Добавить(НСтр("ru = 'При установке значения параметра более 50 необходимо проконсультироваться со службой  технической поддержки банка.'"));
		МассивТекста.Добавить("");
		МассивТекста.Добавить(НСтр("ru = 'Продолжить?'"));
		ТекстВопроса = СтрСоединить(МассивТекста,Символы.ПС);
		
		КнопкиОтвета = Новый СписокЗначений;
		КнопкиОтвета.Добавить(КодВозвратаДиалога.Да,НСтр("ru = 'Продолжить'"));
		КнопкиОтвета.Добавить(КодВозвратаДиалога.Отмена, НСтр("ru = 'Отмена'"));
		
		ПоказатьВопрос(ОписаниеОповещения,ТекстВопроса,КнопкиОтвета,,,НСтр("ru = 'Внимание!'"));
	ИначеЕсли КоличествоСообщенийВПакете < 1 Тогда
		КоличествоСообщенийВПакете = 1;
	КонецЕсли;
	
	ИспользоватьПакетныйОбмен = КоличествоСообщенийВПакете > 1;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеПодключенияРасширенияДляРаботыСФайламиПриОткрытии(Подключено, ДополнительныеПараметры) Экспорт
	
	Если Подключено Тогда
		Элементы.КаталогДляЖурналирования.КнопкаВыбора = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораКаталога(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = "" Тогда
		Возврат;
	КонецЕсли;
	
	Запись.КаталогДляЖурналирования = Результат;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриПолученииОтветаНаВопросКоличествоСообщенийВПакете(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ Результат = КодВозвратаДиалога.Да Тогда
		КоличествоСообщенийВПакете = 50;
	Иначе
		ПоказатьПредупреждениеОКоличествеСообщений = Ложь;
	КонецЕсли; 
		
КонецПроцедуры

&НаКлиенте
Процедура ПриПолученииОтветаНаВопросИспользоватьПакетныйОбмен(Результат, ДополнительныеПараметры) Экспорт
	
	ИспользоватьПакетныйОбмен = Результат = КодВозвратаДиалога.Да;		

	Если ИспользоватьПакетныйОбмен Тогда
		КоличествоСообщенийВПакете = 50;		
	КонецЕсли;
	
	ИспользоватьПакетныйОбменОбработкаИзменения();
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьПакетныйОбменОбработкаИзменения()
	
	Элементы.ГруппаКоличествоСообщенийВПакете.Видимость = ИспользоватьПакетныйОбмен;	
	
КонецПроцедуры

#КонецОбласти
